; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	infrared2 - mode
	thermograph4 - mode
	thermograph0 - mode
	infrared1 - mode
	image3 - mode
	star1 - direction
	groundstation0 - direction
	star2 - direction
	groundstation3 - direction
	star4 - direction
	star5 - direction
	phenomenon6 - direction
	planet7 - direction
	phenomenon8 - direction
	planet9 - direction
	phenomenon10 - direction
	planet11 - direction
	planet12 - direction
	planet13 - direction
	planet14 - direction
	star15 - direction
	star16 - direction
	phenomenon17 - direction
	phenomenon18 - direction
	star19 - direction
	planet20 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet13)
	(supports instrument1 thermograph4)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 star1)
	(supports instrument2 image3)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 phenomenon6)
	(supports instrument3 image3)
	(calibration_target instrument3 star2)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared1)
	(supports instrument4 image3)
	(calibration_target instrument4 groundstation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 star16)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 star2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 star15)
	(supports instrument6 image3)
	(calibration_target instrument6 groundstation3)
	(supports instrument7 image3)
	(supports instrument7 infrared1)
	(calibration_target instrument7 star4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 phenomenon10)
)
(:goal (and
	(pointing satellite0 star4)
	(pointing satellite1 star16)
	(have_image star5 infrared2)
	(have_image phenomenon6 infrared1)
	(have_image planet7 image3)
	(have_image phenomenon8 thermograph0)
	(have_image planet9 infrared2)
	(have_image phenomenon10 infrared2)
	(have_image planet11 thermograph0)
	(have_image planet12 thermograph0)
	(have_image planet13 thermograph4)
	(have_image planet14 image3)
	(have_image star15 thermograph0)
	(have_image star16 thermograph4)
	(have_image phenomenon17 image3)
	(have_image phenomenon18 thermograph4)
	(have_image star19 infrared1)
	(have_image planet20 image3)
))

)

; plan
1. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 18
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 18
3. (turn_to satellite3 phenomenon18 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 phenomenon18)
   goals met: 0 of 18
4. (turn_to satellite1 phenomenon10 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon10)
   goals met: 0 of 18
5. (turn_to satellite0 star4 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star4)
   goals met: 1 of 18
6. (turn_to satellite1 star2 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star2)
   goals met: 1 of 18
7. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 1 of 18
8. (turn_to satellite1 phenomenon10 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 18
9. (take_image satellite1 phenomenon10 instrument2 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 2 of 18
10. (turn_to satellite1 phenomenon17 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 18
11. (take_image satellite1 phenomenon17 instrument2 image3)
   added: (have_image phenomenon17 image3)
   goals met: 3 of 18
12. (turn_to satellite1 phenomenon8 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 18
13. (take_image satellite1 phenomenon8 instrument2 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 4 of 18
14. (turn_to satellite1 planet11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet11)
   goals met: 4 of 18
15. (take_image satellite1 planet11 instrument2 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 5 of 18
16. (turn_to satellite1 planet12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet12)
   goals met: 5 of 18
17. (take_image satellite1 planet12 instrument2 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 6 of 18
18. (turn_to satellite1 planet14 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet14)
   goals met: 6 of 18
19. (take_image satellite1 planet14 instrument2 image3)
   added: (have_image planet14 image3)
   goals met: 7 of 18
20. (turn_to satellite1 planet20 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet20)
   goals met: 7 of 18
21. (take_image satellite1 planet20 instrument2 image3)
   added: (have_image planet20 image3)
   goals met: 8 of 18
22. (turn_to satellite1 planet7 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 planet7)
   goals met: 8 of 18
23. (take_image satellite1 planet7 instrument2 image3)
   added: (have_image planet7 image3)
   goals met: 9 of 18
24. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 9 of 18
25. (take_image satellite1 planet9 instrument2 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 10 of 18
26. (turn_to satellite1 star15 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star15)
   goals met: 10 of 18
27. (take_image satellite1 star15 instrument2 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 11 of 18
28. (turn_to satellite1 star5 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star5)
   goals met: 11 of 18
29. (take_image satellite1 star5 instrument2 infrared2)
   added: (have_image star5 infrared2)
   goals met: 12 of 18
30. (turn_to satellite1 star16 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star16)
   goals met: 13 of 18
31. (turn_to satellite3 star2 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 star2)
   goals met: 13 of 18
32. (calibrate satellite3 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 13 of 18
33. (turn_to satellite3 phenomenon18 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon18)
   goals met: 13 of 18
34. (take_image satellite3 phenomenon18 instrument5 thermograph4)
   added: (have_image phenomenon18 thermograph4)
   goals met: 14 of 18
35. (turn_to satellite3 phenomenon6 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 phenomenon6)
   goals met: 14 of 18
36. (take_image satellite3 phenomenon6 instrument5 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 15 of 18
37. (turn_to satellite3 planet13 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 planet13)
   goals met: 15 of 18
38. (take_image satellite3 planet13 instrument5 thermograph4)
   added: (have_image planet13 thermograph4)
   goals met: 16 of 18
39. (turn_to satellite3 star16 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 star16)
   goals met: 16 of 18
40. (take_image satellite3 star16 instrument5 thermograph4)
   added: (have_image star16 thermograph4)
   goals met: 17 of 18
41. (turn_to satellite3 star19 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 star19)
   goals met: 17 of 18
42. (take_image satellite3 star19 instrument5 infrared1)
   added: (have_image star19 infrared1)
   goals met: 18 of 18
